<script setup lang="ts">
useSeoMeta({
      title: "back vs front"
    }
)
</script>


<template>
  <BaseApp0>
    <template v-slot:header>
      Frontend и Backend
    </template>
    <template v-slot:main>
      <h1>Frontend и Backend</h1>
      <img width="60%" src="/images/front-vs-back.webp"
           alt="backend vs frontend"/>
      <p>Вы наверняка уже слышали эти модные в сфере программирования слова «фронтенд» и «бэкенд», но что за ними стоит?
        Предлагаем с этим разобраться.</p>
      <h2>Frontend</h2>
      <p>Фронтенд — все, что браузер может читать, выводить на экран и / или запускать. То есть это HTML, CSS и
        JavaScript.
      </p>
      <p>
        HTML (HyperText Markup Language) говорит браузеру, каково содержание страницы, например, «заголовок»,
        «параграф», «список», «элемент списка».
      </p>
      <p>
        CSS (Cascading Style Sheets) говорит браузеру, как отображать элементы, например, «после первого параграфа
        отступ в 20 пикселей» или «весь текст в элементе body должен быть темно-серым и написан шрифтом Verdana».
      </p>
      <p>
        JavaScript говорит браузеру, как реагировать на некоторые взаимодействия, используя легкий язык
        программирования. Большинство сайтов на самом деле не используют много JavaScript, но если вы нажмете на что-то
        и содержимое страницы поменяется без белого мигания экрана, значит, где-то использовался JavaScript.
      </p>
      <h2>Backend</h2>
      <p>
        Бэкенд — все, что работает на сервере, то есть «не в браузере» или «на компьютере, подсоединенном к сети (обычно
        к Интернету), который отвечает на сообщения от других компьютеров».
      </p>
      <img width="50%" src="/images/dart.webp"
           alt="dart"/>
      <p>
        Для бэкенда вы можете использовать любые инструменты, доступные на вашем сервере (который, по сути, является
        просто компьютером, настроенным для ответов на сообщения). Это означает, что вы можете использовать любой
        универсальный язык программирования: Ruby, PHP, Python, Java, JavaScript / Node, bash. Это также означает, что
        вы можете использовать системы управления базами данных, такие как MySQL, PostgreSQL, MongoDB, Cassandra, Redis,
        Memcached.
      </p>
      <img width="40%" src="/images/lion.webp" alt="lion"/>
    </template>
  </BaseApp0>
</template>


<style scoped lang="scss">
@import "/styles/base";

</style>
