<script setup lang="ts">
useSeoMeta({
      title: "Программирование"
    }
)
</script>


<template>
  <BaseApp1Right>
    <template v-slot:header>
      Программирование
    </template>
    <template v-slot:main>
      <h1>Что такое программирование?</h1>
      <p>
        Программирование — это процесс создания компьютерных программ или программного обеспечения, а также дисциплина,
        изучающая методы и приёмы создания и развития компьютерных программ.
      </p>
      <img
          src="/images/progs.webp"
          width="50%"
          alt="code"/>
      <p>
        Программирование включает следующие этапы:
      </p>
      <ul>
        <li>Анализ предметной области</li>
        <li>Проектирование программы</li>
        <li>Кодирование</li>
        <li>Выявление дефектов и ошибок при помощи тестирования и других методов верификации</li>
        <li>Развёртывание</li>
        <li>Сопровождение</li>
      </ul>
      <p>
        Как дисциплина программирование изучает принципы построения и функционирования программ, используя методы и
        технические приёмы, а также способы организации как крупных программных систем, так и небольших элементов
        программ.
      </p>
      <p>
        В зависимости от поставленных целей, размерности задачи, методов решения различают параллельное
        программирование, распределённое программирование и др. Языки программирования поддерживают различные стили
        программирования (парадигмы программирования). В искусство программирования входит выбор языка программирования,
        наиболее полно подходящего для решения поставленной задачи.
      </p>
      <br/>
      <br/>
      <img
          src="/images/utia.webp"
          width="50%" alt="utochka"/>
    </template>
    <template v-slot:aside>
      <h2>Статьи</h2>
      <ul>
        <li>
          <NuxtLink to="/web/prog/lang">Языки программирования</NuxtLink>
        </li>
        <li>
          <NuxtLink to="/web/prog/back-front">Frontend и Backend</NuxtLink>
        </li>
        <li>
          <NuxtLink to="/web/prog/linux">Что такое Linux?</NuxtLink>
        </li>
      </ul>
      <h2>Анкета</h2>
      <p>
        <NuxtLink to="/web/prog/what-lang">Какие ЯП Вы знаете?</NuxtLink>
      </p>
      <img
          src="/images/laptop.webp"
          width="95%" alt="laptop and programming"/>
    </template>
  </BaseApp1Right>
</template>


<style scoped lang="scss">
@import "/styles/base";
</style>
