<script setup lang="ts">
useSeoMeta({
      title: "JS"
    }
)
</script>

<template>
  <BaseApp0>
    <template v-slot:header>
      JavaScript
    </template>
    <template v-slot:main>
      <img src="https://logo-base.com/logo/javascript_js_logo_icon.png" alt="js"/>
      <h1>JavaScript</h1>
      <p>
        JavaScript (англ. /ˈdʒɑːvəskrɪpt/; аббр. JS) — мультипарадигменный язык программирования. Поддерживает
        объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript
        (стандарт ECMA-262).
      </p>
      <p>
        JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее
        широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.
      </p>
      <p>
        Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление памятью,
        прототипное программирование, функции как объекты первого класса.
      </p>
      <p>
        На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. Языком
        JavaScript не владеет какая-либо организация или компания, что отличает его от ряда языков программирования,
        используемых в веб-разработке.
      </p>
      <img
          src="https://teachandstudy.ru/media/uploads/course_logo/EzgdmaCQuT84bgDL4fhXZS.jpg"
          alt="js"/>
      <p>
        Название «JavaScript» является зарегистрированным товарным знаком корпорации Oracle в США.
      </p>
      <h2>История</h2>
      <p>
        Перед Бренданом Эйхом, нанятым в компанию Netscape 4 апреля 1995 года, была поставлена задача внедрить язык
        программирования Scheme или что-то похожее в браузер Netscape. Поскольку требования были размыты, Эйха перевели
        в группу, ответственную за серверные продукты, где он проработал месяц, занимаясь улучшением протокола HTTP.
        В мае разработчик был переброшен обратно, в команду, занимающуюся клиентской частью (браузером), где он
        немедленно начал разрабатывать концепцию нового языка программирования. Менеджмент разработки браузера, включая
        Тома Пакина (англ. Tom Paquin), Михаэля Тоя, Рика Шелла (англ. Rick Schell), был убеждён, что Netscape
        должен поддерживать язык программирования, встраиваемый в HTML-код страницы.
      </p>
      <p>
        Помимо Брендана Эйха, в разработке участвовали сооснователь Netscape Communications Марк Андрессен и
        сооснователь Sun Microsystems Билл Джой: чтобы успеть закончить работы над языком к релизу браузера, компании
        заключили соглашение о сотрудничестве в разработке. Они ставили перед собой цель обеспечить «язык для
        склеивания» составляющих частей веб-ресурса: изображений, плагинов, Java-апплетов, который был бы удобен для
        веб-дизайнеров и программистов, не обладающих высокой квалификацией.
      </p>
      <img src="https://u.9111s.ru/uploads/202205/18/6d3b44802cab7967006e385b0f071e30.jpg" alt="js"/>
      <p>
        Первоначально по предложению Марка Андрессена язык был назван Mocha, был реализован Бренданом
        Эйхом в течение десяти дней и впервые был включен в пре-альфу версию Netscape 2. Затем он был переименован в
        LiveScript и предназначался как для программирования на стороне клиента, так и для программирования на
        стороне сервера (там он должен был называться LiveWire). На синтаксис оказали влияние языки Си и Java, и,
        поскольку Java в то время было модным словом, 4 декабря 1995 года LiveScript переименовали в
        JavaScript, получив соответствующую лицензию у Sun. Анонс JavaScript со стороны представителей Netscape и
        Sun состоялся накануне выпуска второй бета-версии Netscape Navigator. В нём декларируется, что 28 лидирующих
        ИТ-компаний выразили намерение использовать в своих будущих продуктах JavaScript как объектный скриптовый язык с
        открытым стандартом.
      </p>
      <p>
        В 1996 году компания Microsoft выпустила аналог языка JavaScript, названный JScript. Анонсирован этот язык был
        18 июля 1996 года. Первым браузером, поддерживающим эту реализацию, был Internet Explorer 3.0.
      </p>
      <p>
        По инициативе компании Netscape была проведена стандартизация языка ассоциацией ECMA.
        Стандартизированная версия имеет название ECMAScript, описывается стандартом ECMA-262. Первой версии
        спецификации соответствовал JavaScript версии 1.1, а также языки JScript и ScriptEasy.
      </p>
    </template>
  </BaseApp0>
</template>

<style scoped lang="scss">
@import "/styles/base";

img {
  width: 30%;
  float: right;
}
</style>