<script setup lang="ts">
useSeoMeta({
      title: "Linux"
    }
)
</script>

<template>
  <BaseApp0>
    <template v-slot:header>
      Linux
    </template>
    <template v-slot:main>
      <img class="ff" src="https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Tux.svg/800px-Tux.svg.png"
           alt="linux"/>
      <h1>Что такое Linux?</h1>
      <p>
        Linux (Ли́нукс; в части случаев GNU/Linux) — семейство
        Unix-подобных операционных систем на базе ядра Linux, включающих тот или иной набор утилит и программ проекта
        GNU, и, возможно, другие компоненты. Как и ядро Linux, системы на его основе, как правило, создаются и
        распространяются в соответствии с моделью разработки свободного и открытого программного обеспечения.
        GNU/Linux-системы распространяются в основном бесплатно в виде различных дистрибутивов — в форме, готовой для
        установки и удобной для сопровождения и обновлений, — и имеющих свой набор системных и прикладных компонентов,
        как свободных, так и проприетарных.
      </p>
      <p>
        Появившись как решения вокруг созданного в начале 1990-х годов ядра, уже с начала 2000-х годов системы Linux
        являются основными для суперкомпьютеров и серверов, расширяется применение их для встраиваемых систем и
        мобильных устройств, некоторое распространение системы получили и для персональных
        компьютеров.
      </p>
      <img width="30%" src="https://www.tapeciarnia.pl/tapety/normalne/76351_linux_kontra_windows.jpg"
           alt="linux vs windows"/>
      <p>
        За счёт использования свободного программного обеспечения и привлечения волонтёров каждая из систем Linux
        обладает значительными программными возможностями, трудно реализуемыми в прочих моделях разработки: например, в
        2008 году расчёты показывали, что для того, чтобы «с нуля» разработать систему, аналогичную Fedora 9,
        потребовалось бы затратить $10,8 млрд, а совокупная себестоимость только ядра Linux оценивалась в сумму
        более $1,4 млрд, притом только за 2008 год она увеличилась на $315 млн, совокупный труд оценён в размере 73 тыс.
        человеко-лет.
      </p>
      <img width="40%" src="https://www.scaler.com/topics/images/daemon.webp" alt="daemon"/>
      <img width="40%" src="https://i.playground.ru/p/NZ5jgsu8AaucSUtk8LKmcA.jpeg" alt="daemon"/>
      <p>
        Семейство систем, включающих в качестве компонентов основные программы проекта GNU, такие как bash, gcc, glibc,
        coreutils и ряд других, иногда идентифицируется как GNU/Linux. Так как традиционно большинство систем было
        именно таким, под «Linux» обычно подразумеваются именно они; притом существует спор об именовании GNU/Linux.
        Существует проект стандартизации внутренней структуры Linux-систем — Linux Standard Base, часть документов
        которого зарегистрирована в качестве стандартов ISO; но далеко не все системы сертифицируются по нему, и в целом
        для Linux-систем не существует какой-либо общепризнанной стандартной комплектации или формальных условий
        включения в семейство. Однако есть ряд систем на базе ядра Linux, но не имеющих в основе зависимости от программ
        GNU, которые поэтому "GNU/Linux" не называют, в частности, таковы мобильные системы Android и FirefoxOS.
      </p>
      <img width="30%" src="https://fedoraproject.org/assets/images/atomic-desktops/screenshot-kinoite.jpg"
           alt="fedora"/>
      <img width="40%"
           src="https://avatars.mds.yandex.net/i?id=ed37056661b7688d40d3aa8287fe7cd1a20367a6-7985106-images-thumbs&n=13"
           alt="fedora"/>
      <p>
        Официальным логотипом и талисманом Linux является пингвин Tux, созданный в 1996 году Ларри Юингом. Торговая
        марка «Linux» принадлежит создателю и основному разработчику ядра Линусу Торвальдсу. При этом проект Linux в
        широком смысле не принадлежит какой-либо организации или частному лицу, вклад в его развитие и распространение
        осуществляют тысячи независимых разработчиков и компаний, одним из инструментов взаимодействия которых являются
        группы пользователей Linux. Существует ряд некоммерческих объединений, ставящих основной целью развитие и
        продвижение Linux, наиболее крупное и влиятельное из них — основанный в 2007 году The Linux Foundation.
        Существует значительный рынок коммерческой технической поддержки Linux-систем, на котором с долей свыше 70 %
        (2017) доминирует корпорация Red Hat (поглощена IBM в 2019 году).
      </p>
      <img width="30%" src="https://2compa.ru/wp-content/uploads/2023/11/ubuntu-is-a-operating-system1.jpg"
           alt="ubuntu"/>
      <img width="40%"
           src="https://avatars.mds.yandex.net/i?id=68a7cf0f178a475e0b83fd385875cfcdecfe6477-10812270-images-thumbs&n=13"
           alt="ubuntu"/>
      <h2>Ранняя история</h2>
      <p>
        В 1991 году во время обучения в Хельсинкском университете Линус Торвальдс заинтересовался операционными
        системами и был разочарован лицензией MINIX, которая ограничивала её использование только образовательными
        целями (что исключало любое коммерческое использование), вследствие чего начал работать над своей собственной
        операционной системой, которая в итоге стала Linux.
      </p>
      <img width="30%" src="https://www.itl.cat/pngfile/big/289-2897100_arch-wallpaper-arch-linux.jpg" alt="arch"/>
      <img width="30%" src="https://zalinux.ru/wp-content/uploads/2019/07/manjaro.png" alt="manjaro"/>
      <img width="40%" src="https://robotrackkursk.ru/wp-content/uploads/9/3/6/936ffa514f51a548dfda8ab9ab38277a.png"
           alt="arch"/>
      <p>
        Торвальдс начал разработку ядра Linux на MINIX, и перенёс на него ряд приложений. Позже, когда Linux достиг
        определённой зрелости, появилась возможность продолжать разработку уже на базе самого Linux. Приложения GNU
        вскоре заменили приложения MINIX, так как код GNU, находящийся в свободном доступе, был более удобен для
        применения в молодой операционной системе (исходный код под лицензией GNU GPL может быть использован в других
        проектах, если они также выпускаются под той же или совместимой лицензией, для того чтобы сделать Linux
        доступным для коммерческого использования, Торвальдс начал переходить от своей первоначальной лицензии на GNU
        GPL). Разработчики работали над полной интеграцией компонентов GNU в Linux с целью создания
        полнофункциональной и свободной операционной системы (Linux).
      </p>
    </template>
  </BaseApp0>
</template>


<style scoped lang="scss">
@import "/styles/base";

.ff {
  width: 40%;
  float: right;
}
</style>
