<script setup lang="ts">

</script>

<template>
  <BaseApp0>
    <template v-slot:header>
      Python
    </template>
    <template v-slot:main>
      <img src="https://logos-download.com/wp-content/uploads/2016/10/Python_logo_icon.png" alt="python"/>
      <h1>Python</h1>
      <p>Python (в русском языке встречаются названия пито́н или па́йтон) — высокоуровневый
        язык программирования общего назначения с динамической строгой типизацией и автоматическим управлением
        памятью, ориентированный на повышение производительности разработчика, читаемости кода и его качества, а
        также на обеспечение переносимости написанных на нём программ. Язык является полностью
        объектно-ориентированным в том плане, что всё является объектами. Необычной особенностью языка является
        выделение блоков кода отступами. Синтаксис ядра языка минималистичен, за счёт чего на практике редко
        возникает необходимость обращаться к документации. Сам же язык известен как интерпретируемый и используется
        в том числе для написания скриптов. Недостатками языка являются зачастую более низкая скорость работы и
        более высокое потребление памяти написанных на нём программ по сравнению с аналогичным кодом, написанным на
        компилируемых языках, таких как <code>C</code> или <code>C++</code>.
      </p>
      <h2>История</h2>
      <p>
        Задумка по реализации языка появилась в конце 1980-х годов, а разработка его реализации началась в 1989 году
        сотрудником голландского института CWI Гвидо ван Россумом. Для распределённой операционной системы Amoeba
        требовался расширяемый скриптовый язык, и Гвидо начал разрабатывать Python на досуге, позаимствовав некоторые
        наработки для языка ABC (Гвидо участвовал в разработке этого языка, ориентированного на обучение
        программированию). В феврале 1991 года Гвидо опубликовал исходный текст в группе новостей alt.sources. С
        самого начала Python проектировался как объектно-ориентированный язык.
      </p>
      <p>
        Гвидо ван Россум назвал язык в честь популярного британского комедийного телешоу 1970-х «Летающий цирк Монти
        Пайтона», поскольку автор был поклонником этого телешоу, как и многие другие разработчики того времени, а в
        самом шоу прослеживалась некая параллель с миром компьютерной техники.
      </p>
      <p>
        Наличие дружелюбного, отзывчивого сообщества пользователей считается, наряду с дизайнерской интуицией Гвидо,
        одним из факторов успеха Python. Развитие языка происходит согласно чётко регламентированному процессу создания,
        обсуждения, отбора и реализации документов PEP (англ. Python Enhancement Proposal) — предложений по развитию
        Python.
      </p>
      <p>
        3 декабря 2008 года, после длительного тестирования, вышла первая версия Python 3000 (или Python 3.0, также
        используется сокращение Py3k). В Python 3 устранены многие недостатки архитектуры с максимально возможным (но не
        полным) сохранением совместимости со старыми версиями Python.
      </p>
      <p>
        Дата окончания срока поддержки Python 2.7 первоначально была установлена на 2015 год, а затем перенесена на 2020
        год из опасения, что большая часть существующего кода не может быть легко перенесена на Python 3.
        Поддержка Python 2 была направлена лишь на уже существующие проекты, новые проекты должны были использовать
        Python 3. Официально Python 2.7 не поддерживается с 1 января 2020 года, хотя последнее обновление вышло в
        апреле 2020. Больше никаких исправлений безопасности или других улучшений для Python 2.7 не будет
        выпущено. С окончанием срока службы Python 2.x поддерживаются только Python 3.6.x и более поздние
        версии.
      </p>
      <h2>Пример кода</h2>
      <code>
        <pre>
print("Hello World!")
        </pre>
      </code>
      <br/>
      <code>
        <pre>
def factorial(n):
    f = 1
    for i in range (2, n + 1):
        f *= i
    return f

print(factorial(10)) # 3628800
        </pre>
      </code>
    </template>
  </BaseApp0>
</template>

<style scoped lang="scss">
@import "/styles/base";

img {
  width: 40%;
  float: right;
}
</style>