<script setup lang="ts">
</script>


<template>
  <BaseApp0>
    <template v-slot:header>C</template>
    <template v-slot:main>
      <img src="https://static.skillshare.com/uploads/video/thumbnails/b9455fc40a4053509ef0a77b8ddb6a51/original"
           alt="c"/>
      <h1>Язык C</h1>
      <p>
        Си (от лат. буквы C англ. языка) — компилируемый статически типизированный язык программирования общего
        назначения, разработанный в 1969—1973 годах сотрудником Bell Labs Деннисом Ритчи как развитие языка Би.
        Первоначально был разработан для реализации операционной системы UNIX, но впоследствии был перенесён на
        множество других платформ. Согласно дизайну языка, его конструкции близко сопоставляются типичным машинным
        инструкциям, благодаря чему он нашёл применение в проектах, для которых был свойственен язык ассемблера, в том
        числе как в операционных системах, так и в различном прикладном программном обеспечении для множества устройств
        — от суперкомпьютеров до встраиваемых систем. Язык программирования Си оказал существенное влияние на развитие
        индустрии программного обеспечения, а его синтаксис стал основой для таких языков программирования, как <code>C++</code>,
        <code>C#</code>,
        <code>Java</code> и <code>Objective-C</code>.
      </p>
      <h2>История</h2>
      <p>
        Язык программирования Си разрабатывался в период с 1969 по 1973 годы в лабораториях Bell Labs, и к 1973 году на
        этот язык была переписана большая часть ядра UNIX, первоначально написанного на ассемблере PDP-11/20. Название
        языка стало логическим продолжением старого языка «Би», многие особенности которого были положены в основу.
      </p>
      <p>
        По мере развития язык сначала стандартизировали как ANSI C, а затем этот стандарт был принят комитетом по
        международной стандартизации ISO как ISO C, ставший также известным под названием C90. В стандарте С99 язык
        получил новые возможности, такие как массивы переменной длины и встраиваемые функции. А в стандарте C11 в язык
        добавили реализацию потоков и поддержку атомарных типов. Однако с тех пор язык развивается медленно, и в
        стандарт C18 попали лишь исправления ошибок стандарта C11.
      </p>
      <h2>Пример кода</h2>
      <code>
        <pre>
#include &lt;stdio.h>
int main(void) // Не принимает аргументы
{
    printf("Hello, world!\n"); // '\n' - новая строка
    return 0; // Удачное завершение программы
}
        </pre>
      </code>
    </template>
  </BaseApp0>
</template>


<style scoped lang="scss">
@import "/styles/base";

img {
  width: 40%;
  float: right;
}
</style>
